LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
/*
 * lightranger8.h
 *
 *  Created on: Aug 22, 2024
 *      Author: Klemen
 */

#ifndef INC_LIGHTRANGER8_H_
#define INC_LIGHTRANGER8_H_





#endif /* INC_LIGHTRANGER8_H_ */


#include "main.h"
#include "stm32h7xx_hal.h"
#include <stdbool.h>
#include "drv_i2c_master.h"
#include "hal_target.h"
#include "hal_i2c_master.h"

I2C_HandleTypeDef hi2c4;

extern I2C_HandleTypeDef hi2c4;

// Define the power control register and the value to power on
#define LIGHTRANGER8_SOFT_RESET                                                         0x0000
#define LIGHTRANGER8_I2C_SLAVE_DEVICE_ADDRESS                                           0x0001
#define LIGHTRANGER8_ANA_CONFIG_VHV_REF_SEL_VDDPIX                                      0x0002
#define LIGHTRANGER8_ANA_CONFIG_VHV_REF_SEL_VQUENCH                                     0x0003
#define LIGHTRANGER8_ANA_CONFIG_REG_AVDD1V2_SEL                                         0x0004
#define LIGHTRANGER8_ANA_CONFIG_FAST_OSC_TRIM                                           0x0005
#define LIGHTRANGER8_OSC_MEASURED_FAST_OSC_FREQUENCY                                    0x0006
#define LIGHTRANGER8_OSC_MEASURED_FAST_OSC_FREQUENCY_HI                                 0x0006
#define LIGHTRANGER8_OSC_MEASURED_FAST_OSC_FREQUENCY_LO                                 0x0007
#define LIGHTRANGER8_VHV_CONFIG_TIMEOUT_MACROP_LOOP_BOUND                               0x0008
#define LIGHTRANGER8_VHV_CONFIG_COUNT_THRESH                                            0x0009
#define LIGHTRANGER8_VHV_CONFIG_OFFSET                                                  0x000A
#define LIGHTRANGER8_VHV_CONFIG_INIT                                                    0x000B
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_REF_0                                   0x000D
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_REF_1                                   0x000E
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_REF_2                                   0x000F
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_REF_3                                   0x0010
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_REF_4                                   0x0011
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_REF_5                                   0x0012
#define LIGHTRANGER8_GLOBAL_CONFIG_REF_EN_START_SELECT                                  0x0013
#define LIGHTRANGER8_REF_SPAD_MAN_NUM_REQUESTED_REF_SPADS                               0x0014
#define LIGHTRANGER8_REF_SPAD_MAN_REF_LOCATION                                          0x0015
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS                      0x0016
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_HI                   0x0016
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_LO                   0x0017
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS                  0x0018
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_HI               0x0018
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_LO               0x0019
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS                  0x001A
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_HI               0x001A
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_LO               0x001B
#define LIGHTRANGER8_REF_SPAD_CHAR_TOTAL_RATE_TARGET_MCPS                               0x001C
#define LIGHTRANGER8_REF_SPAD_CHAR_TOTAL_RATE_TARGET_MCPS_HI                            0x001C
#define LIGHTRANGER8_REF_SPAD_CHAR_TOTAL_RATE_TARGET_MCPS_LO                            0x001D
#define LIGHTRANGER8_ALGO_PART_TO_PART_RANGE_OFFSET_MM                                  0x001E
#define LIGHTRANGER8_ALGO_PART_TO_PART_RANGE_OFFSET_MM_HI                               0x001E
#define LIGHTRANGER8_ALGO_PART_TO_PART_RANGE_OFFSET_MM_LO                               0x001F
#define LIGHTRANGER8_MM_CONFIG_INNER_OFFSET_MM                                          0x0020
#define LIGHTRANGER8_MM_CONFIG_INNER_OFFSET_MM_HI                                       0x0020
#define LIGHTRANGER8_MM_CONFIG_INNER_OFFSET_MM_LO                                       0x0021
#define LIGHTRANGER8_MM_CONFIG_OUTER_OFFSET_MM                                          0x0022
#define LIGHTRANGER8_MM_CONFIG_OUTER_OFFSET_MM_HI                                       0x0022
#define LIGHTRANGER8_MM_CONFIG_OUTER_OFFSET_MM_LO                                       0x0023
#define LIGHTRANGER8_DSS_CONFIG_TARGET_TOTAL_RATE_MCPS                                  0x0024
#define LIGHTRANGER8_DSS_CONFIG_TARGET_TOTAL_RATE_MCPS_HI                               0x0024
#define LIGHTRANGER8_DSS_CONFIG_TARGET_TOTAL_RATE_MCPS_LO                               0x0025
#define LIGHTRANGER8_DEBUG_CTRL                                                         0x0026
#define LIGHTRANGER8_TEST_MODE_CTRL                                                     0x0027
#define LIGHTRANGER8_CLK_GATING_CTRL                                                    0x0028
#define LIGHTRANGER8_NVM_BIST_CTRL                                                      0x0029
#define LIGHTRANGER8_NVM_BIST_NUM_NVM_WORDS                                             0x002A
#define LIGHTRANGER8_NVM_BIST_START_ADDRESS                                             0x002B
#define LIGHTRANGER8_HOST_IF_STATUS                                                     0x002C
#define LIGHTRANGER8_PAD_I2C_HV_CONFIG                                                  0x002D
#define LIGHTRANGER8_PAD_I2C_HV_EXTSUP_CONFIG                                           0x002E
#define LIGHTRANGER8_GPIO_HV_PAD_CTRL                                                   0x002F
#define LIGHTRANGER8_GPIO_HV_MUX_CTRL                                                   0x0030
#define LIGHTRANGER8_GPIO_TIO_HV_STATUS                                                 0x0031
#define LIGHTRANGER8_GPIO_FIO_HV_STATUS                                                 0x0032
#define LIGHTRANGER8_ANA_CONFIG_SPAD_SEL_PSWIDTH                                        0x0033
#define LIGHTRANGER8_ANA_CONFIG_VCSEL_PULSE_WIDTH_OFFSET                                0x0034
#define LIGHTRANGER8_ANA_CONFIG_FAST_OSC_CONFIG_CTRL                                    0x0035
#define LIGHTRANGER8_SIGMA_ESTIMATOR_EFFECTIVE_PULSE_WIDTH_NS                           0x0036
#define LIGHTRANGER8_SIGMA_ESTIMATOR_EFFECTIVE_AMBIENT_WIDTH_NS                         0x0037
#define LIGHTRANGER8_SIGMA_ESTIMATOR_SIGMA_REF_MM                                       0x0038
#define LIGHTRANGER8_ALGO_CROSSTALK_COMPENSATION_VALID_HEIGHT_MM                        0x0039
#define LIGHTRANGER8_SPARE_HOST_CONFIG_STATIC_CONFIG_SPARE_0                            0x003A
#define LIGHTRANGER8_SPARE_HOST_CONFIG_STATIC_CONFIG_SPARE_1                            0x003B
#define LIGHTRANGER8_ALGO_RANGE_IGNORE_THRESHOLD_MCPS                                   0x003C
#define LIGHTRANGER8_ALGO_RANGE_IGNORE_THRESHOLD_MCPS_HI                                0x003C
#define LIGHTRANGER8_ALGO_RANGE_IGNORE_THRESHOLD_MCPS_LO                                0x003D
#define LIGHTRANGER8_ALGO_RANGE_IGNORE_VALID_HEIGHT_MM                                  0x003E
#define LIGHTRANGER8_ALGO_RANGE_MIN_CLIP                                                0x003F
#define LIGHTRANGER8_ALGO_CONSISTENCY_CHECK_TOLERANCE                                   0x0040
#define LIGHTRANGER8_SPARE_HOST_CONFIG_STATIC_CONFIG_SPARE_2                            0x0041
#define LIGHTRANGER8_SD_CONFIG_RESET_STAGES_MSB                                         0x0042
#define LIGHTRANGER8_SD_CONFIG_RESET_STAGES_LSB                                         0x0043
#define LIGHTRANGER8_GPH_CONFIG_STREAM_COUNT_UPDATE_VALUE                               0x0044
#define LIGHTRANGER8_GLOBAL_CONFIG_STREAM_DIVIDER                                       0x0045
#define LIGHTRANGER8_SYSTEM_INTERRUPT_CONFIG_GPIO                                       0x0046
#define LIGHTRANGER8_CAL_CONFIG_VCSEL_START                                             0x0047
#define LIGHTRANGER8_CAL_CONFIG_REPEAT_RATE                                             0x0048
#define LIGHTRANGER8_CAL_CONFIG_REPEAT_RATE_HI                                          0x0048
#define LIGHTRANGER8_CAL_CONFIG_REPEAT_RATE_LO                                          0x0049
#define LIGHTRANGER8_GLOBAL_CONFIG_VCSEL_WIDTH                                          0x004A
#define LIGHTRANGER8_PHASECAL_CONFIG_TIMEOUT_MACROP                                     0x004B
#define LIGHTRANGER8_PHASECAL_CONFIG_TARGET                                             0x004C
#define LIGHTRANGER8_PHASECAL_CONFIG_OVERRIDE                                           0x004D
#define LIGHTRANGER8_DSS_CONFIG_ROI_MODE_CONTROL                                        0x004F
#define LIGHTRANGER8_SYSTEM_THRESH_RATE_HIGH                                            0x0050
#define LIGHTRANGER8_SYSTEM_THRESH_RATE_HIGH_HI                                         0x0050
#define LIGHTRANGER8_SYSTEM_THRESH_RATE_HIGH_LO                                         0x0051
#define LIGHTRANGER8_SYSTEM_THRESH_RATE_LOW                                             0x0052
#define LIGHTRANGER8_SYSTEM_THRESH_RATE_LOW_HI                                          0x0052
#define LIGHTRANGER8_SYSTEM_THRESH_RATE_LOW_LO                                          0x0053
#define LIGHTRANGER8_DSS_CONFIG_MANUAL_EFFECTIVE_SPADS_SELECT                           0x0054
#define LIGHTRANGER8_DSS_CONFIG_MANUAL_EFFECTIVE_SPADS_SELECT_HI                        0x0054
#define LIGHTRANGER8_DSS_CONFIG_MANUAL_EFFECTIVE_SPADS_SELECT_LO                        0x0055
#define LIGHTRANGER8_DSS_CONFIG_MANUAL_BLOCK_SELECT                                     0x0056
#define LIGHTRANGER8_DSS_CONFIG_APERTURE_ATTENUATION                                    0x0057
#define LIGHTRANGER8_DSS_CONFIG_MAX_SPADS_LIMIT                                         0x0058
#define LIGHTRANGER8_DSS_CONFIG_MIN_SPADS_LIMIT                                         0x0059
#define LIGHTRANGER8_MM_CONFIG_TIMEOUT_MACROP_A_HI                                      0x005A
#define LIGHTRANGER8_MM_CONFIG_TIMEOUT_MACROP_A_LO                                      0x005B
#define LIGHTRANGER8_MM_CONFIG_TIMEOUT_MACROP_B_HI                                      0x005C
#define LIGHTRANGER8_MM_CONFIG_TIMEOUT_MACROP_B_LO                                      0x005D
#define LIGHTRANGER8_RANGE_CONFIG_TIMEOUT_MACROP_A_HI                                   0x005E
#define LIGHTRANGER8_RANGE_CONFIG_TIMEOUT_MACROP_A_LO                                   0x005F
#define LIGHTRANGER8_RANGE_CONFIG_VCSEL_PERIOD_A                                        0x0060
#define LIGHTRANGER8_RANGE_CONFIG_TIMEOUT_MACROP_B_HI                                   0x0061
#define LIGHTRANGER8_RANGE_CONFIG_TIMEOUT_MACROP_B_LO                                   0x0062
#define LIGHTRANGER8_RANGE_CONFIG_VCSEL_PERIOD_B                                        0x0063
#define LIGHTRANGER8_RANGE_CONFIG_SIGMA_THRESH                                          0x0064
#define LIGHTRANGER8_RANGE_CONFIG_SIGMA_THRESH_HI                                       0x0064
#define LIGHTRANGER8_RANGE_CONFIG_SIGMA_THRESH_LO                                       0x0065
#define LIGHTRANGER8_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT_MCPS                         0x0066
#define LIGHTRANGER8_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT_MCPS_HI                      0x0066
#define LIGHTRANGER8_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT_MCPS_LO                      0x0067
#define LIGHTRANGER8_RANGE_CONFIG_VALID_PHASE_LOW                                       0x0068
#define LIGHTRANGER8_RANGE_CONFIG_VALID_PHASE_HIGH                                      0x0069
#define LIGHTRANGER8_SYSTEM_INTERMEASUREMENT_PERIOD                                     0x006C
#define LIGHTRANGER8_SYSTEM_INTERMEASUREMENT_PERIOD_3                                   0x006C
#define LIGHTRANGER8_SYSTEM_INTERMEASUREMENT_PERIOD_2                                   0x006D
#define LIGHTRANGER8_SYSTEM_INTERMEASUREMENT_PERIOD_1                                   0x006E
#define LIGHTRANGER8_SYSTEM_INTERMEASUREMENT_PERIOD_0                                   0x006F
#define LIGHTRANGER8_SYSTEM_FRACTIONAL_ENABLE                                           0x0070
#define LIGHTRANGER8_SYSTEM_GROUPED_PARAMETER_HOLD_0                                    0x0071
#define LIGHTRANGER8_SYSTEM_THRESH_HIGH                                                 0x0072
#define LIGHTRANGER8_SYSTEM_THRESH_HIGH_HI                                              0x0072
#define LIGHTRANGER8_SYSTEM_THRESH_HIGH_LO                                              0x0073
#define LIGHTRANGER8_SYSTEM_THRESH_LOW                                                  0x0074
#define LIGHTRANGER8_SYSTEM_THRESH_LOW_HI                                               0x0074
#define LIGHTRANGER8_SYSTEM_THRESH_LOW_LO                                               0x0075
#define LIGHTRANGER8_SYSTEM_ENABLE_XTALK_PER_QUADRANT                                   0x0076
#define LIGHTRANGER8_SYSTEM_SEED_CONFIG                                                 0x0077
#define LIGHTRANGER8_SD_CONFIG_WOI_SD0                                                  0x0078
#define LIGHTRANGER8_SD_CONFIG_WOI_SD1                                                  0x0079
#define LIGHTRANGER8_SD_CONFIG_INITIAL_PHASE_SD0                                        0x007A
#define LIGHTRANGER8_SD_CONFIG_INITIAL_PHASE_SD1                                        0x007B
#define LIGHTRANGER8_SYSTEM_GROUPED_PARAMETER_HOLD_1                                    0x007C
#define LIGHTRANGER8_SD_CONFIG_FIRST_ORDER_SELECT                                       0x007D
#define LIGHTRANGER8_SD_CONFIG_QUANTIFIER                                               0x007E
#define LIGHTRANGER8_ROI_CONFIG_USER_ROI_CENTRE_SPAD                                    0x007F
#define LIGHTRANGER8_ROI_CONFIG_USER_ROI_REQUESTED_GLOBAL_XY_SIZE                       0x0080
#define LIGHTRANGER8_SYSTEM_SEQUENCE_CONFIG                                             0x0081
#define LIGHTRANGER8_SYSTEM_GROUPED_PARAMETER_HOLD                                      0x0082
#define LIGHTRANGER8_POWER_MANAGEMENT_GO1_POWER_FORCE                                   0x0083
#define LIGHTRANGER8_SYSTEM_STREAM_COUNT_CTRL                                           0x0084
#define LIGHTRANGER8_FIRMWARE_ENABLE                                                    0x0085
#define LIGHTRANGER8_SYSTEM_INTERRUPT_CLEAR                                             0x0086
#define LIGHTRANGER8_SYSTEM_MODE_START                                                  0x0087
#define LIGHTRANGER8_RESULT_INTERRUPT_STATUS                                            0x0088
#define LIGHTRANGER8_RESULT_RANGE_STATUS                                                0x0089
#define LIGHTRANGER8_RESULT_REPORT_STATUS                                               0x008A
#define LIGHTRANGER8_RESULT_STREAM_COUNT                                                0x008B
#define LIGHTRANGER8_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0                              0x008C
#define LIGHTRANGER8_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI                           0x008C
#define LIGHTRANGER8_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO                           0x008D
#define LIGHTRANGER8_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0                             0x008E
#define LIGHTRANGER8_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI                          0x008E
#define LIGHTRANGER8_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO                          0x008F
#define LIGHTRANGER8_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0                                 0x0090
#define LIGHTRANGER8_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0_HI                              0x0090
#define LIGHTRANGER8_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0_LO                              0x0091
#define LIGHTRANGER8_RESULT_SIGMA_SD0                                                   0x0092
#define LIGHTRANGER8_RESULT_SIGMA_SD0_HI                                                0x0092
#define LIGHTRANGER8_RESULT_SIGMA_SD0_LO                                                0x0093
#define LIGHTRANGER8_RESULT_PHASE_SD0                                                   0x0094
#define LIGHTRANGER8_RESULT_PHASE_SD0_HI                                                0x0094
#define LIGHTRANGER8_RESULT_PHASE_SD0_LO                                                0x0095
#define LIGHTRANGER8_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0                      0x0096
#define LIGHTRANGER8_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI                   0x0096
#define LIGHTRANGER8_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO                   0x0097
#define LIGHTRANGER8_PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0                0x0098
#define LIGHTRANGER8_PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI             0x0098
#define LIGHTRANGER8_PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO             0x0099
#define LIGHTRANGER8_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0                         0x009A
#define LIGHTRANGER8_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI                      0x009A
#define LIGHTRANGER8_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO                      0x009B
#define LIGHTRANGER8_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0                         0x009C
#define LIGHTRANGER8_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI                      0x009C
#define LIGHTRANGER8_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO                      0x009D
#define LIGHTRANGER8_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0                              0x009E
#define LIGHTRANGER8_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI                           0x009E
#define LIGHTRANGER8_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO                           0x009F
#define LIGHTRANGER8_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1                              0x00A0
#define LIGHTRANGER8_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI                           0x00A0
#define LIGHTRANGER8_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO                           0x00A1
#define LIGHTRANGER8_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1                             0x00A2
#define LIGHTRANGER8_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI                          0x00A2
#define LIGHTRANGER8_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO                          0x00A3
#define LIGHTRANGER8_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1                                 0x00A4
#define LIGHTRANGER8_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1_HI                              0x00A4
#define LIGHTRANGER8_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1_LO                              0x00A5
#define LIGHTRANGER8_RESULT_SIGMA_SD1                                                   0x00A6
#define LIGHTRANGER8_RESULT_SIGMA_SD1_HI                                                0x00A6
#define LIGHTRANGER8_RESULT_SIGMA_SD1_LO                                                0x00A7
#define LIGHTRANGER8_RESULT_PHASE_SD1                                                   0x00A8
#define LIGHTRANGER8_RESULT_PHASE_SD1_HI                                                0x00A8
#define LIGHTRANGER8_RESULT_PHASE_SD1_LO                                                0x00A9
#define LIGHTRANGER8_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1                      0x00AA
#define LIGHTRANGER8_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI                   0x00AA
#define LIGHTRANGER8_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO                   0x00AB
#define LIGHTRANGER8_RESULT_SPARE_0_SD1                                                 0x00AC
#define LIGHTRANGER8_RESULT_SPARE_0_SD1_HI                                              0x00AC
#define LIGHTRANGER8_RESULT_SPARE_0_SD1_LO                                              0x00AD
#define LIGHTRANGER8_RESULT_SPARE_1_SD1                                                 0x00AE
#define LIGHTRANGER8_RESULT_SPARE_1_SD1_HI                                              0x00AE
#define LIGHTRANGER8_RESULT_SPARE_1_SD1_LO                                              0x00AF
#define LIGHTRANGER8_RESULT_SPARE_2_SD1                                                 0x00B0
#define LIGHTRANGER8_RESULT_SPARE_2_SD1_HI                                              0x00B0
#define LIGHTRANGER8_RESULT_SPARE_2_SD1_LO                                              0x00B1
#define LIGHTRANGER8_RESULT_SPARE_3_SD1                                                 0x00B2
#define LIGHTRANGER8_RESULT_THRESH_INFO                                                 0x00B3
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0                              0x00B4
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_3                            0x00B4
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_2                            0x00B5
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_1                            0x00B6
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_0                            0x00B7
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0                               0x00B8
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_3                             0x00B8
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_2                             0x00B9
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_1                             0x00BA
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_0                             0x00BB
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0                                0x00BC
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_3                              0x00BC
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_2                              0x00BD
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_1                              0x00BE
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_0                              0x00BF
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0                              0x00C0
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_3                            0x00C0
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_2                            0x00C1
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_1                            0x00C2
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_0                            0x00C3
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1                              0x00C4
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_3                            0x00C4
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_2                            0x00C5
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_1                            0x00C6
#define LIGHTRANGER8_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_0                            0x00C7
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1                               0x00C8
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_3                             0x00C8
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_2                             0x00C9
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_1                             0x00CA
#define LIGHTRANGER8_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_0                             0x00CB
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1                                0x00CC
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_3                              0x00CC
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_2                              0x00CD
