LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_1                              0x00CE
#define LIGHTRANGER8_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_0                              0x00CF
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1                              0x00D0
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_3                            0x00D0
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_2                            0x00D1
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_1                            0x00D2
#define LIGHTRANGER8_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_0                            0x00D3
#define LIGHTRANGER8_RESULT_CORE_SPARE_0                                                0x00D4
#define LIGHTRANGER8_PHASECAL_RESULT_REFERENCE_PHASE                                    0x00D6
#define LIGHTRANGER8_PHASECAL_RESULT_REFERENCE_PHASE_HI                                 0x00D6
#define LIGHTRANGER8_PHASECAL_RESULT_REFERENCE_PHASE_LO                                 0x00D7
#define LIGHTRANGER8_PHASECAL_RESULT_VCSEL_START                                        0x00D8
#define LIGHTRANGER8_REF_SPAD_CHAR_RESULT_NUM_ACTUAL_REF_SPADS                          0x00D9
#define LIGHTRANGER8_REF_SPAD_CHAR_RESULT_REF_LOCATION                                  0x00DA
#define LIGHTRANGER8_VHV_RESULT_COLDBOOT_STATUS                                         0x00DB
#define LIGHTRANGER8_VHV_RESULT_SEARCH_RESULT                                           0x00DC
#define LIGHTRANGER8_VHV_RESULT_LATEST_SETTING                                          0x00DD
#define LIGHTRANGER8_RESULT_OSC_CALIBRATE_VAL                                           0x00DE
#define LIGHTRANGER8_RESULT_OSC_CALIBRATE_VAL_HI                                        0x00DE
#define LIGHTRANGER8_RESULT_OSC_CALIBRATE_VAL_LO                                        0x00DF
#define LIGHTRANGER8_ANA_CONFIG_POWERDOWN_GO1                                           0x00E0
#define LIGHTRANGER8_ANA_CONFIG_REF_BG_CTRL                                             0x00E1
#define LIGHTRANGER8_ANA_CONFIG_REGDVDD1V2_CTRL                                         0x00E2
#define LIGHTRANGER8_ANA_CONFIG_OSC_SLOW_CTRL                                           0x00E3
#define LIGHTRANGER8_TEST_MODE_STATUS                                                   0x00E4
#define LIGHTRANGER8_FIRMWARE_SYSTEM_STATUS                                             0x00E5
#define LIGHTRANGER8_FIRMWARE_MODE_STATUS                                               0x00E6
#define LIGHTRANGER8_FIRMWARE_SECONDARY_MODE_STATUS                                     0x00E7
#define LIGHTRANGER8_FIRMWARE_CAL_REPEAT_RATE_COUNTER                                   0x00E8
#define LIGHTRANGER8_FIRMWARE_CAL_REPEAT_RATE_COUNTER_HI                                0x00E8
#define LIGHTRANGER8_FIRMWARE_CAL_REPEAT_RATE_COUNTER_LO                                0x00E9
#define LIGHTRANGER8_FIRMWARE_HISTOGRAM_BIN                                             0x00EA
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_HIGH                                             0x00EC
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_HIGH_HI                                          0x00EC
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_HIGH_LO                                          0x00ED
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_LOW                                              0x00EE
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_LOW_HI                                           0x00EE
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_LOW_LO                                           0x00EF
#define LIGHTRANGER8_GPH_SYSTEM_ENABLE_XTALK_PER_QUADRANT                               0x00F0
#define LIGHTRANGER8_GPH_SPARE_0                                                        0x00F1
#define LIGHTRANGER8_GPH_SD_CONFIG_WOI_SD0                                              0x00F2
#define LIGHTRANGER8_GPH_SD_CONFIG_WOI_SD1                                              0x00F3
#define LIGHTRANGER8_GPH_SD_CONFIG_INITIAL_PHASE_SD0                                    0x00F4
#define LIGHTRANGER8_GPH_SD_CONFIG_INITIAL_PHASE_SD1                                    0x00F5
#define LIGHTRANGER8_GPH_SD_CONFIG_FIRST_ORDER_SELECT                                   0x00F6
#define LIGHTRANGER8_GPH_SD_CONFIG_QUANTIFIER                                           0x00F7
#define LIGHTRANGER8_GPH_ROI_CONFIG_USER_ROI_CENTRE_SPAD                                0x00F8
#define LIGHTRANGER8_GPH_ROI_CONFIG_USER_ROI_REQUESTED_GLOBAL_XY_SIZE                   0x00F9
#define LIGHTRANGER8_GPH_SYSTEM_SEQUENCE_CONFIG                                         0x00FA
#define LIGHTRANGER8_GPH_GPH_ID                                                         0x00FB
#define LIGHTRANGER8_SYSTEM_INTERRUPT_SET                                               0x00FC
#define LIGHTRANGER8_INTERRUPT_MANAGER_ENABLES                                          0x00FD
#define LIGHTRANGER8_INTERRUPT_MANAGER_CLEAR                                            0x00FE
#define LIGHTRANGER8_INTERRUPT_MANAGER_STATUS                                           0x00FF
#define LIGHTRANGER8_MCU_TO_HOST_BANK_WR_ACCESS_EN                                      0x0100
#define LIGHTRANGER8_POWER_MANAGEMENT_GO1_RESET_STATUS                                  0x0101
#define LIGHTRANGER8_PAD_STARTUP_MODE_VALUE_RO                                          0x0102
#define LIGHTRANGER8_PAD_STARTUP_MODE_VALUE_CTRL                                        0x0103
#define LIGHTRANGER8_PLL_PERIOD_US                                                      0x0104
#define LIGHTRANGER8_PLL_PERIOD_US_3                                                    0x0104
#define LIGHTRANGER8_PLL_PERIOD_US_2                                                    0x0105
#define LIGHTRANGER8_PLL_PERIOD_US_1                                                    0x0106
#define LIGHTRANGER8_PLL_PERIOD_US_0                                                    0x0107
#define LIGHTRANGER8_INTERRUPT_SCHEDULER_DATA_OUT                                       0x0108
#define LIGHTRANGER8_INTERRUPT_SCHEDULER_DATA_OUT_3                                     0x0108
#define LIGHTRANGER8_INTERRUPT_SCHEDULER_DATA_OUT_2                                     0x0109
#define LIGHTRANGER8_INTERRUPT_SCHEDULER_DATA_OUT_1                                     0x010A
#define LIGHTRANGER8_INTERRUPT_SCHEDULER_DATA_OUT_0                                     0x010B
#define LIGHTRANGER8_NVM_BIST_COMPLETE                                                  0x010C
#define LIGHTRANGER8_NVM_BIST_STATUS                                                    0x010D
#define LIGHTRANGER8_IDENTIFICATION_MODEL_ID                                            0x010F
#define LIGHTRANGER8_IDENTIFICATION_MODULE_TYPE                                         0x0110
#define LIGHTRANGER8_IDENTIFICATION_REVISION_ID                                         0x0111
#define LIGHTRANGER8_IDENTIFICATION_MODULE_ID                                           0x0112
#define LIGHTRANGER8_IDENTIFICATION_MODULE_ID_HI                                        0x0112
#define LIGHTRANGER8_IDENTIFICATION_MODULE_ID_LO                                        0x0113
#define LIGHTRANGER8_ANA_CONFIG_FAST_OSC_TRIM_MAX                                       0x0114
#define LIGHTRANGER8_ANA_CONFIG_FAST_OSC_FREQ_SET                                       0x0115
#define LIGHTRANGER8_ANA_CONFIG_VCSEL_TRIM                                              0x0116
#define LIGHTRANGER8_ANA_CONFIG_VCSEL_SELION                                            0x0117
#define LIGHTRANGER8_ANA_CONFIG_VCSEL_SELION_MAX                                        0x0118
#define LIGHTRANGER8_PROTECTED_LASER_SAFETY_LOCK_BIT                                    0x0119
#define LIGHTRANGER8_LASER_SAFETY_KEY                                                   0x011A
#define LIGHTRANGER8_LASER_SAFETY_KEY_RO                                                0x011B
#define LIGHTRANGER8_LASER_SAFETY_CLIP                                                  0x011C
#define LIGHTRANGER8_LASER_SAFETY_MULT                                                  0x011D
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_0                                   0x011E
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_1                                   0x011F
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_2                                   0x0120
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_3                                   0x0121
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_4                                   0x0122
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_5                                   0x0123
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_6                                   0x0124
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_7                                   0x0125
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_8                                   0x0126
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_9                                   0x0127
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_10                                  0x0128
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_11                                  0x0129
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_12                                  0x012A
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_13                                  0x012B
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_14                                  0x012C
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_15                                  0x012D
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_16                                  0x012E
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_17                                  0x012F
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_18                                  0x0130
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_19                                  0x0131
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_20                                  0x0132
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_21                                  0x0133
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_22                                  0x0134
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_23                                  0x0135
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_24                                  0x0136
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_25                                  0x0137
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_26                                  0x0138
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_27                                  0x0139
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_28                                  0x013A
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_29                                  0x013B
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_30                                  0x013C
#define LIGHTRANGER8_GLOBAL_CONFIG_SPAD_ENABLES_RTN_31                                  0x013D
#define LIGHTRANGER8_ROI_CONFIG_MODE_ROI_CENTRE_SPAD                                    0x013E
#define LIGHTRANGER8_ROI_CONFIG_MODE_ROI_XY_SIZE                                        0x013F
#define LIGHTRANGER8_GO2_HOST_BANK_ACCESS_OVERRIDE                                      0x0300
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLICAND                                   0x0400
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLICAND_3                                 0x0400
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLICAND_2                                 0x0401
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLICAND_1                                 0x0402
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLICAND_0                                 0x0403
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLIER                                     0x0404
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLIER_3                                   0x0404
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLIER_2                                   0x0405
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLIER_1                                   0x0406
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_MULTIPLIER_0                                   0x0407
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_HI                                     0x0408
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_HI_3                                   0x0408
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_HI_2                                   0x0409
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_HI_1                                   0x040A
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_HI_0                                   0x040B
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_LO                                     0x040C
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_LO_3                                   0x040C
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_LO_2                                   0x040D
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_LO_1                                   0x040E
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_PRODUCT_LO_0                                   0x040F
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_START                                          0x0410
#define LIGHTRANGER8_MCU_UTIL_MULTIPLIER_STATUS                                         0x0411
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_START                                             0x0412
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_STATUS                                            0x0413
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVIDEND                                          0x0414
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVIDEND_3                                        0x0414
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVIDEND_2                                        0x0415
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVIDEND_1                                        0x0416
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVIDEND_0                                        0x0417
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVISOR                                           0x0418
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVISOR_3                                         0x0418
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVISOR_2                                         0x0419
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVISOR_1                                         0x041A
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_DIVISOR_0                                         0x041B
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_QUOTIENT                                          0x041C
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_QUOTIENT_3                                        0x041C
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_QUOTIENT_2                                        0x041D
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_QUOTIENT_1                                        0x041E
#define LIGHTRANGER8_MCU_UTIL_DIVIDER_QUOTIENT_0                                        0x041F
#define LIGHTRANGER8_TIMER0_VALUE_IN                                                    0x0420
#define LIGHTRANGER8_TIMER0_VALUE_IN_3                                                  0x0420
#define LIGHTRANGER8_TIMER0_VALUE_IN_2                                                  0x0421
#define LIGHTRANGER8_TIMER0_VALUE_IN_1                                                  0x0422
#define LIGHTRANGER8_TIMER0_VALUE_IN_0                                                  0x0423
#define LIGHTRANGER8_TIMER1_VALUE_IN                                                    0x0424
#define LIGHTRANGER8_TIMER1_VALUE_IN_3                                                  0x0424
#define LIGHTRANGER8_TIMER1_VALUE_IN_2                                                  0x0425
#define LIGHTRANGER8_TIMER1_VALUE_IN_1                                                  0x0426
#define LIGHTRANGER8_TIMER1_VALUE_IN_0                                                  0x0427
#define LIGHTRANGER8_TIMER0_CTRL                                                        0x0428
#define LIGHTRANGER8_TIMER1_CTRL                                                        0x0429
#define LIGHTRANGER8_MCU_GENERAL_PURPOSE_GP_0                                           0x042C
#define LIGHTRANGER8_MCU_GENERAL_PURPOSE_GP_1                                           0x042D
#define LIGHTRANGER8_MCU_GENERAL_PURPOSE_GP_2                                           0x042E
#define LIGHTRANGER8_MCU_GENERAL_PURPOSE_GP_3                                           0x042F
#define LIGHTRANGER8_MCU_RANGE_CALC_CONFIG                                              0x0430
#define LIGHTRANGER8_MCU_RANGE_CALC_OFFSET_CORRECTED_RANGE                              0x0432
#define LIGHTRANGER8_MCU_RANGE_CALC_OFFSET_CORRECTED_RANGE_HI                           0x0432
#define LIGHTRANGER8_MCU_RANGE_CALC_OFFSET_CORRECTED_RANGE_LO                           0x0433
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_4                                             0x0434
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_4_3                                           0x0434
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_4_2                                           0x0435
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_4_1                                           0x0436
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_4_0                                           0x0437
#define LIGHTRANGER8_MCU_RANGE_CALC_AMBIENT_DURATION_PRE_CALC                           0x0438
#define LIGHTRANGER8_MCU_RANGE_CALC_AMBIENT_DURATION_PRE_CALC_HI                        0x0438
#define LIGHTRANGER8_MCU_RANGE_CALC_AMBIENT_DURATION_PRE_CALC_LO                        0x0439
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_VCSEL_PERIOD                                   0x043C
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_5                                             0x043D
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_TOTAL_PERIODS                                  0x043E
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_TOTAL_PERIODS_HI                               0x043E
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_TOTAL_PERIODS_LO                               0x043F
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ACCUM_PHASE                                    0x0440
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ACCUM_PHASE_3                                  0x0440
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ACCUM_PHASE_2                                  0x0441
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ACCUM_PHASE_1                                  0x0442
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ACCUM_PHASE_0                                  0x0443
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_SIGNAL_EVENTS                                  0x0444
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_SIGNAL_EVENTS_3                                0x0444
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_SIGNAL_EVENTS_2                                0x0445
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_SIGNAL_EVENTS_1                                0x0446
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_SIGNAL_EVENTS_0                                0x0447
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_AMBIENT_EVENTS                                 0x0448
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_AMBIENT_EVENTS_3                               0x0448
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_AMBIENT_EVENTS_2                               0x0449
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_AMBIENT_EVENTS_1                               0x044A
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_AMBIENT_EVENTS_0                               0x044B
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_6                                             0x044C
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_6_HI                                          0x044C
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_6_LO                                          0x044D
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ADJUST_VCSEL_PERIOD                            0x044E
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ADJUST_VCSEL_PERIOD_HI                         0x044E
#define LIGHTRANGER8_MCU_RANGE_CALC_ALGO_ADJUST_VCSEL_PERIOD_LO                         0x044F
#define LIGHTRANGER8_MCU_RANGE_CALC_NUM_SPADS                                           0x0450
#define LIGHTRANGER8_MCU_RANGE_CALC_NUM_SPADS_HI                                        0x0450
#define LIGHTRANGER8_MCU_RANGE_CALC_NUM_SPADS_LO                                        0x0451
#define LIGHTRANGER8_MCU_RANGE_CALC_PHASE_OUTPUT                                        0x0452
#define LIGHTRANGER8_MCU_RANGE_CALC_PHASE_OUTPUT_HI                                     0x0452
#define LIGHTRANGER8_MCU_RANGE_CALC_PHASE_OUTPUT_LO                                     0x0453
#define LIGHTRANGER8_MCU_RANGE_CALC_RATE_PER_SPAD_MCPS                                  0x0454
#define LIGHTRANGER8_MCU_RANGE_CALC_RATE_PER_SPAD_MCPS_3                                0x0454
#define LIGHTRANGER8_MCU_RANGE_CALC_RATE_PER_SPAD_MCPS_2                                0x0455
#define LIGHTRANGER8_MCU_RANGE_CALC_RATE_PER_SPAD_MCPS_1                                0x0456
#define LIGHTRANGER8_MCU_RANGE_CALC_RATE_PER_SPAD_MCPS_0                                0x0457
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_7                                             0x0458
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_8                                             0x0459
#define LIGHTRANGER8_MCU_RANGE_CALC_PEAK_SIGNAL_RATE_MCPS                               0x045A
#define LIGHTRANGER8_MCU_RANGE_CALC_PEAK_SIGNAL_RATE_MCPS_HI                            0x045A
#define LIGHTRANGER8_MCU_RANGE_CALC_PEAK_SIGNAL_RATE_MCPS_LO                            0x045B
#define LIGHTRANGER8_MCU_RANGE_CALC_AVG_SIGNAL_RATE_MCPS                                0x045C
#define LIGHTRANGER8_MCU_RANGE_CALC_AVG_SIGNAL_RATE_MCPS_HI                             0x045C
#define LIGHTRANGER8_MCU_RANGE_CALC_AVG_SIGNAL_RATE_MCPS_LO                             0x045D
#define LIGHTRANGER8_MCU_RANGE_CALC_AMBIENT_RATE_MCPS                                   0x045E
#define LIGHTRANGER8_MCU_RANGE_CALC_AMBIENT_RATE_MCPS_HI                                0x045E
#define LIGHTRANGER8_MCU_RANGE_CALC_AMBIENT_RATE_MCPS_LO                                0x045F
#define LIGHTRANGER8_MCU_RANGE_CALC_XTALK                                               0x0460
#define LIGHTRANGER8_MCU_RANGE_CALC_XTALK_HI                                            0x0460
#define LIGHTRANGER8_MCU_RANGE_CALC_XTALK_LO                                            0x0461
#define LIGHTRANGER8_MCU_RANGE_CALC_CALC_STATUS                                         0x0462
#define LIGHTRANGER8_MCU_RANGE_CALC_DEBUG                                               0x0463
#define LIGHTRANGER8_MCU_RANGE_CALC_PEAK_SIGNAL_RATE_XTALK_CORR_MCPS                    0x0464
#define LIGHTRANGER8_MCU_RANGE_CALC_PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_HI                 0x0464
#define LIGHTRANGER8_MCU_RANGE_CALC_PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_LO                 0x0465
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_0                                             0x0468
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_1                                             0x0469
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_2                                             0x046A
#define LIGHTRANGER8_MCU_RANGE_CALC_SPARE_3                                             0x046B
#define LIGHTRANGER8_PATCH_CTRL                                                         0x0470
#define LIGHTRANGER8_PATCH_JMP_ENABLES                                                  0x0472
#define LIGHTRANGER8_PATCH_JMP_ENABLES_HI                                               0x0472
#define LIGHTRANGER8_PATCH_JMP_ENABLES_LO                                               0x0473
