LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
#define LIGHTRANGER8_PATCH_DATA_ENABLES                                                 0x0474
#define LIGHTRANGER8_PATCH_DATA_ENABLES_HI                                              0x0474
#define LIGHTRANGER8_PATCH_DATA_ENABLES_LO                                              0x0475
#define LIGHTRANGER8_PATCH_OFFSET_0                                                     0x0476
#define LIGHTRANGER8_PATCH_OFFSET_0_HI                                                  0x0476
#define LIGHTRANGER8_PATCH_OFFSET_0_LO                                                  0x0477
#define LIGHTRANGER8_PATCH_OFFSET_1                                                     0x0478
#define LIGHTRANGER8_PATCH_OFFSET_1_HI                                                  0x0478
#define LIGHTRANGER8_PATCH_OFFSET_1_LO                                                  0x0479
#define LIGHTRANGER8_PATCH_OFFSET_2                                                     0x047A
#define LIGHTRANGER8_PATCH_OFFSET_2_HI                                                  0x047A
#define LIGHTRANGER8_PATCH_OFFSET_2_LO                                                  0x047B
#define LIGHTRANGER8_PATCH_OFFSET_3                                                     0x047C
#define LIGHTRANGER8_PATCH_OFFSET_3_HI                                                  0x047C
#define LIGHTRANGER8_PATCH_OFFSET_3_LO                                                  0x047D
#define LIGHTRANGER8_PATCH_OFFSET_4                                                     0x047E
#define LIGHTRANGER8_PATCH_OFFSET_4_HI                                                  0x047E
#define LIGHTRANGER8_PATCH_OFFSET_4_LO                                                  0x047F
#define LIGHTRANGER8_PATCH_OFFSET_5                                                     0x0480
#define LIGHTRANGER8_PATCH_OFFSET_5_HI                                                  0x0480
#define LIGHTRANGER8_PATCH_OFFSET_5_LO                                                  0x0481
#define LIGHTRANGER8_PATCH_OFFSET_6                                                     0x0482
#define LIGHTRANGER8_PATCH_OFFSET_6_HI                                                  0x0482
#define LIGHTRANGER8_PATCH_OFFSET_6_LO                                                  0x0483
#define LIGHTRANGER8_PATCH_OFFSET_7                                                     0x0484
#define LIGHTRANGER8_PATCH_OFFSET_7_HI                                                  0x0484
#define LIGHTRANGER8_PATCH_OFFSET_7_LO                                                  0x0485
#define LIGHTRANGER8_PATCH_OFFSET_8                                                     0x0486
#define LIGHTRANGER8_PATCH_OFFSET_8_HI                                                  0x0486
#define LIGHTRANGER8_PATCH_OFFSET_8_LO                                                  0x0487
#define LIGHTRANGER8_PATCH_OFFSET_9                                                     0x0488
#define LIGHTRANGER8_PATCH_OFFSET_9_HI                                                  0x0488
#define LIGHTRANGER8_PATCH_OFFSET_9_LO                                                  0x0489
#define LIGHTRANGER8_PATCH_OFFSET_10                                                    0x048A
#define LIGHTRANGER8_PATCH_OFFSET_10_HI                                                 0x048A
#define LIGHTRANGER8_PATCH_OFFSET_10_LO                                                 0x048B
#define LIGHTRANGER8_PATCH_OFFSET_11                                                    0x048C
#define LIGHTRANGER8_PATCH_OFFSET_11_HI                                                 0x048C
#define LIGHTRANGER8_PATCH_OFFSET_11_LO                                                 0x048D
#define LIGHTRANGER8_PATCH_OFFSET_12                                                    0x048E
#define LIGHTRANGER8_PATCH_OFFSET_12_HI                                                 0x048E
#define LIGHTRANGER8_PATCH_OFFSET_12_LO                                                 0x048F
#define LIGHTRANGER8_PATCH_OFFSET_13                                                    0x0490
#define LIGHTRANGER8_PATCH_OFFSET_13_HI                                                 0x0490
#define LIGHTRANGER8_PATCH_OFFSET_13_LO                                                 0x0491
#define LIGHTRANGER8_PATCH_OFFSET_14                                                    0x0492
#define LIGHTRANGER8_PATCH_OFFSET_14_HI                                                 0x0492
#define LIGHTRANGER8_PATCH_OFFSET_14_LO                                                 0x0493
#define LIGHTRANGER8_PATCH_OFFSET_15                                                    0x0494
#define LIGHTRANGER8_PATCH_OFFSET_15_HI                                                 0x0494
#define LIGHTRANGER8_PATCH_OFFSET_15_LO                                                 0x0495
#define LIGHTRANGER8_PATCH_ADDRESS_0                                                    0x0496
#define LIGHTRANGER8_PATCH_ADDRESS_0_HI                                                 0x0496
#define LIGHTRANGER8_PATCH_ADDRESS_0_LO                                                 0x0497
#define LIGHTRANGER8_PATCH_ADDRESS_1                                                    0x0498
#define LIGHTRANGER8_PATCH_ADDRESS_1_HI                                                 0x0498
#define LIGHTRANGER8_PATCH_ADDRESS_1_LO                                                 0x0499
#define LIGHTRANGER8_PATCH_ADDRESS_2                                                    0x049A
#define LIGHTRANGER8_PATCH_ADDRESS_2_HI                                                 0x049A
#define LIGHTRANGER8_PATCH_ADDRESS_2_LO                                                 0x049B
#define LIGHTRANGER8_PATCH_ADDRESS_3                                                    0x049C
#define LIGHTRANGER8_PATCH_ADDRESS_3_HI                                                 0x049C
#define LIGHTRANGER8_PATCH_ADDRESS_3_LO                                                 0x049D
#define LIGHTRANGER8_PATCH_ADDRESS_4                                                    0x049E
#define LIGHTRANGER8_PATCH_ADDRESS_4_HI                                                 0x049E
#define LIGHTRANGER8_PATCH_ADDRESS_4_LO                                                 0x049F
#define LIGHTRANGER8_PATCH_ADDRESS_5                                                    0x04A0
#define LIGHTRANGER8_PATCH_ADDRESS_5_HI                                                 0x04A0
#define LIGHTRANGER8_PATCH_ADDRESS_5_LO                                                 0x04A1
#define LIGHTRANGER8_PATCH_ADDRESS_6                                                    0x04A2
#define LIGHTRANGER8_PATCH_ADDRESS_6_HI                                                 0x04A2
#define LIGHTRANGER8_PATCH_ADDRESS_6_LO                                                 0x04A3
#define LIGHTRANGER8_PATCH_ADDRESS_7                                                    0x04A4
#define LIGHTRANGER8_PATCH_ADDRESS_7_HI                                                 0x04A4
#define LIGHTRANGER8_PATCH_ADDRESS_7_LO                                                 0x04A5
#define LIGHTRANGER8_PATCH_ADDRESS_8                                                    0x04A6
#define LIGHTRANGER8_PATCH_ADDRESS_8_HI                                                 0x04A6
#define LIGHTRANGER8_PATCH_ADDRESS_8_LO                                                 0x04A7
#define LIGHTRANGER8_PATCH_ADDRESS_9                                                    0x04A8
#define LIGHTRANGER8_PATCH_ADDRESS_9_HI                                                 0x04A8
#define LIGHTRANGER8_PATCH_ADDRESS_9_LO                                                 0x04A9
#define LIGHTRANGER8_PATCH_ADDRESS_10                                                   0x04AA
#define LIGHTRANGER8_PATCH_ADDRESS_10_HI                                                0x04AA
#define LIGHTRANGER8_PATCH_ADDRESS_10_LO                                                0x04AB
#define LIGHTRANGER8_PATCH_ADDRESS_11                                                   0x04AC
#define LIGHTRANGER8_PATCH_ADDRESS_11_HI                                                0x04AC
#define LIGHTRANGER8_PATCH_ADDRESS_11_LO                                                0x04AD
#define LIGHTRANGER8_PATCH_ADDRESS_12                                                   0x04AE
#define LIGHTRANGER8_PATCH_ADDRESS_12_HI                                                0x04AE
#define LIGHTRANGER8_PATCH_ADDRESS_12_LO                                                0x04AF
#define LIGHTRANGER8_PATCH_ADDRESS_13                                                   0x04B0
#define LIGHTRANGER8_PATCH_ADDRESS_13_HI                                                0x04B0
#define LIGHTRANGER8_PATCH_ADDRESS_13_LO                                                0x04B1
#define LIGHTRANGER8_PATCH_ADDRESS_14                                                   0x04B2
#define LIGHTRANGER8_PATCH_ADDRESS_14_HI                                                0x04B2
#define LIGHTRANGER8_PATCH_ADDRESS_14_LO                                                0x04B3
#define LIGHTRANGER8_PATCH_ADDRESS_15                                                   0x04B4
#define LIGHTRANGER8_PATCH_ADDRESS_15_HI                                                0x04B4
#define LIGHTRANGER8_PATCH_ADDRESS_15_LO                                                0x04B5
#define LIGHTRANGER8_SPI_ASYNC_MUX_CTRL                                                 0x04C0
#define LIGHTRANGER8_CLK_CONFIG                                                         0x04C4
#define LIGHTRANGER8_GPIO_LV_MUX_CTRL                                                   0x04CC
#define LIGHTRANGER8_GPIO_LV_PAD_CTRL                                                   0x04CD
#define LIGHTRANGER8_PAD_I2C_LV_CONFIG                                                  0x04D0
#define LIGHTRANGER8_PAD_STARTUP_MODE_VALUE_RO_GO1                                      0x04D4
#define LIGHTRANGER8_HOST_IF_STATUS_GO1                                                 0x04D5
#define LIGHTRANGER8_MCU_CLK_GATING_CTRL                                                0x04D8
#define LIGHTRANGER8_TEST_BIST_ROM_CTRL                                                 0x04E0
#define LIGHTRANGER8_TEST_BIST_ROM_RESULT                                               0x04E1
#define LIGHTRANGER8_TEST_BIST_ROM_MCU_SIG                                              0x04E2
#define LIGHTRANGER8_TEST_BIST_ROM_MCU_SIG_HI                                           0x04E2
#define LIGHTRANGER8_TEST_BIST_ROM_MCU_SIG_LO                                           0x04E3
#define LIGHTRANGER8_TEST_BIST_RAM_CTRL                                                 0x04E4
#define LIGHTRANGER8_TEST_BIST_RAM_RESULT                                               0x04E5
#define LIGHTRANGER8_TEST_TMC                                                           0x04E8
#define LIGHTRANGER8_TEST_PLL_BIST_MIN_THRESHOLD                                        0x04F0
#define LIGHTRANGER8_TEST_PLL_BIST_MIN_THRESHOLD_HI                                     0x04F0
#define LIGHTRANGER8_TEST_PLL_BIST_MIN_THRESHOLD_LO                                     0x04F1
#define LIGHTRANGER8_TEST_PLL_BIST_MAX_THRESHOLD                                        0x04F2
#define LIGHTRANGER8_TEST_PLL_BIST_MAX_THRESHOLD_HI                                     0x04F2
#define LIGHTRANGER8_TEST_PLL_BIST_MAX_THRESHOLD_LO                                     0x04F3
#define LIGHTRANGER8_TEST_PLL_BIST_COUNT_OUT                                            0x04F4
#define LIGHTRANGER8_TEST_PLL_BIST_COUNT_OUT_HI                                         0x04F4
#define LIGHTRANGER8_TEST_PLL_BIST_COUNT_OUT_LO                                         0x04F5
#define LIGHTRANGER8_TEST_PLL_BIST_GONOGO                                               0x04F6
#define LIGHTRANGER8_TEST_PLL_BIST_CTRL                                                 0x04F7
#define LIGHTRANGER8_RANGING_CORE_DEVICE_ID                                             0x0680
#define LIGHTRANGER8_RANGING_CORE_REVISION_ID                                           0x0681
#define LIGHTRANGER8_RANGING_CORE_CLK_CTRL1                                             0x0683
#define LIGHTRANGER8_RANGING_CORE_CLK_CTRL2                                             0x0684
#define LIGHTRANGER8_RANGING_CORE_WOI_1                                                 0x0685
#define LIGHTRANGER8_RANGING_CORE_WOI_REF_1                                             0x0686
#define LIGHTRANGER8_RANGING_CORE_START_RANGING                                         0x0687
#define LIGHTRANGER8_RANGING_CORE_LOW_LIMIT_1                                           0x0690
#define LIGHTRANGER8_RANGING_CORE_HIGH_LIMIT_1                                          0x0691
#define LIGHTRANGER8_RANGING_CORE_LOW_LIMIT_REF_1                                       0x0692
#define LIGHTRANGER8_RANGING_CORE_HIGH_LIMIT_REF_1                                      0x0693
#define LIGHTRANGER8_RANGING_CORE_QUANTIFIER_1_MSB                                      0x0694
#define LIGHTRANGER8_RANGING_CORE_QUANTIFIER_1_LSB                                      0x0695
#define LIGHTRANGER8_RANGING_CORE_QUANTIFIER_REF_1_MSB                                  0x0696
#define LIGHTRANGER8_RANGING_CORE_QUANTIFIER_REF_1_LSB                                  0x0697
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_OFFSET_1_MSB                                  0x0698
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_OFFSET_1_LSB                                  0x0699
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_OFFSET_REF_1_MSB                              0x069A
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_OFFSET_REF_1_LSB                              0x069B
#define LIGHTRANGER8_RANGING_CORE_FILTER_STRENGTH_1                                     0x069C
#define LIGHTRANGER8_RANGING_CORE_FILTER_STRENGTH_REF_1                                 0x069D
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_EVENT_LIMIT_1_MSB                              0x069E
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_EVENT_LIMIT_1_LSB                              0x069F
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_EVENT_LIMIT_REF_1_MSB                          0x06A0
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_EVENT_LIMIT_REF_1_LSB                          0x06A1
#define LIGHTRANGER8_RANGING_CORE_TIMEOUT_OVERALL_PERIODS_MSB                           0x06A4
#define LIGHTRANGER8_RANGING_CORE_TIMEOUT_OVERALL_PERIODS_LSB                           0x06A5
#define LIGHTRANGER8_RANGING_CORE_INVERT_HW                                             0x06A6
#define LIGHTRANGER8_RANGING_CORE_FORCE_HW                                              0x06A7
#define LIGHTRANGER8_RANGING_CORE_STATIC_HW_VALUE                                       0x06A8
#define LIGHTRANGER8_RANGING_CORE_FORCE_CONTINUOUS_AMBIENT                              0x06A9
#define LIGHTRANGER8_RANGING_CORE_TEST_PHASE_SELECT_TO_FILTER                           0x06AA
#define LIGHTRANGER8_RANGING_CORE_TEST_PHASE_SELECT_TO_TIMING_GEN                       0x06AB
#define LIGHTRANGER8_RANGING_CORE_INITIAL_PHASE_VALUE_1                                 0x06AC
#define LIGHTRANGER8_RANGING_CORE_INITIAL_PHASE_VALUE_REF_1                             0x06AD
#define LIGHTRANGER8_RANGING_CORE_FORCE_UP_IN                                           0x06AE
#define LIGHTRANGER8_RANGING_CORE_FORCE_DN_IN                                           0x06AF
#define LIGHTRANGER8_RANGING_CORE_STATIC_UP_VALUE_1                                     0x06B0
#define LIGHTRANGER8_RANGING_CORE_STATIC_UP_VALUE_REF_1                                 0x06B1
#define LIGHTRANGER8_RANGING_CORE_STATIC_DN_VALUE_1                                     0x06B2
#define LIGHTRANGER8_RANGING_CORE_STATIC_DN_VALUE_REF_1                                 0x06B3
#define LIGHTRANGER8_RANGING_CORE_MONITOR_UP_DN                                         0x06B4
#define LIGHTRANGER8_RANGING_CORE_INVERT_UP_DN                                          0x06B5
#define LIGHTRANGER8_RANGING_CORE_CPUMP_1                                               0x06B6
#define LIGHTRANGER8_RANGING_CORE_CPUMP_2                                               0x06B7
#define LIGHTRANGER8_RANGING_CORE_CPUMP_3                                               0x06B8
#define LIGHTRANGER8_RANGING_CORE_OSC_1                                                 0x06B9
#define LIGHTRANGER8_RANGING_CORE_PLL_1                                                 0x06BB
#define LIGHTRANGER8_RANGING_CORE_PLL_2                                                 0x06BC
#define LIGHTRANGER8_RANGING_CORE_REFERENCE_1                                           0x06BD
#define LIGHTRANGER8_RANGING_CORE_REFERENCE_3                                           0x06BF
#define LIGHTRANGER8_RANGING_CORE_REFERENCE_4                                           0x06C0
#define LIGHTRANGER8_RANGING_CORE_REFERENCE_5                                           0x06C1
#define LIGHTRANGER8_RANGING_CORE_REGAVDD1V2                                            0x06C3
#define LIGHTRANGER8_RANGING_CORE_CALIB_1                                               0x06C4
#define LIGHTRANGER8_RANGING_CORE_CALIB_2                                               0x06C5
#define LIGHTRANGER8_RANGING_CORE_CALIB_3                                               0x06C6
#define LIGHTRANGER8_RANGING_CORE_TST_MUX_SEL1                                          0x06C9
#define LIGHTRANGER8_RANGING_CORE_TST_MUX_SEL2                                          0x06CA
#define LIGHTRANGER8_RANGING_CORE_TST_MUX                                               0x06CB
#define LIGHTRANGER8_RANGING_CORE_GPIO_OUT_TESTMUX                                      0x06CC
#define LIGHTRANGER8_RANGING_CORE_CUSTOM_FE                                             0x06CD
#define LIGHTRANGER8_RANGING_CORE_CUSTOM_FE_2                                           0x06CE
#define LIGHTRANGER8_RANGING_CORE_SPAD_READOUT                                          0x06CF
#define LIGHTRANGER8_RANGING_CORE_SPAD_READOUT_1                                        0x06D0
#define LIGHTRANGER8_RANGING_CORE_SPAD_READOUT_2                                        0x06D1
#define LIGHTRANGER8_RANGING_CORE_SPAD_PS                                               0x06D2
#define LIGHTRANGER8_RANGING_CORE_LASER_SAFETY_2                                        0x06D4
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_MODE                                         0x0780
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_PDN                                          0x0781
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_PROGN                                        0x0782
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_READN                                        0x0783
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_PULSE_WIDTH_MSB                              0x0784
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_PULSE_WIDTH_LSB                              0x0785
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_HV_RISE_MSB                                  0x0786
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_HV_RISE_LSB                                  0x0787
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_HV_FALL_MSB                                  0x0788
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_HV_FALL_LSB                                  0x0789
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_TST                                          0x078A
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_TESTREAD                                     0x078B
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAIN_MMM                                   0x078C
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAIN_LMM                                   0x078D
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAIN_LLM                                   0x078E
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAIN_LLL                                   0x078F
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAOUT_MMM                                  0x0790
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAOUT_LMM                                  0x0791
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAOUT_LLM                                  0x0792
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAOUT_LLL                                  0x0793
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_ADDR                                         0x0794
#define LIGHTRANGER8_RANGING_CORE_NVM_CTRL_DATAOUT_ECC                                  0x0795
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_0                                         0x0796
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_1                                         0x0797
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_2                                         0x0798
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_3                                         0x0799
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_4                                         0x079A
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_5                                         0x079B
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_6                                         0x079C
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_7                                         0x079D
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_8                                         0x079E
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_9                                         0x079F
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_10                                        0x07A0
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_11                                        0x07A1
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_12                                        0x07A2
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_13                                        0x07A3
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_14                                        0x07A4
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_15                                        0x07A5
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_16                                        0x07A6
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_17                                        0x07A7
#define LIGHTRANGER8_RANGING_CORE_SPAD_SHIFT_EN                                         0x07BA
#define LIGHTRANGER8_RANGING_CORE_SPAD_DISABLE_CTRL                                     0x07BB
#define LIGHTRANGER8_RANGING_CORE_SPAD_EN_SHIFT_OUT_DEBUG                               0x07BC
#define LIGHTRANGER8_RANGING_CORE_SPI_MODE                                              0x07BD
#define LIGHTRANGER8_RANGING_CORE_GPIO_DIR                                              0x07BE
#define LIGHTRANGER8_RANGING_CORE_VCSEL_PERIOD                                          0x0880
#define LIGHTRANGER8_RANGING_CORE_VCSEL_START                                           0x0881
#define LIGHTRANGER8_RANGING_CORE_VCSEL_STOP                                            0x0882
#define LIGHTRANGER8_RANGING_CORE_VCSEL_1                                               0x0885
#define LIGHTRANGER8_RANGING_CORE_VCSEL_STATUS                                          0x088D
#define LIGHTRANGER8_RANGING_CORE_STATUS                                                0x0980
#define LIGHTRANGER8_RANGING_CORE_LASER_CONTINUITY_STATE                                0x0981
#define LIGHTRANGER8_RANGING_CORE_RANGE_1_MMM                                           0x0982
#define LIGHTRANGER8_RANGING_CORE_RANGE_1_LMM                                           0x0983
#define LIGHTRANGER8_RANGING_CORE_RANGE_1_LLM                                           0x0984
#define LIGHTRANGER8_RANGING_CORE_RANGE_1_LLL                                           0x0985
#define LIGHTRANGER8_RANGING_CORE_RANGE_REF_1_MMM                                       0x0986
#define LIGHTRANGER8_RANGING_CORE_RANGE_REF_1_LMM                                       0x0987
