LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
#define LIGHTRANGER8_RANGING_CORE_RANGE_REF_1_LLM                                       0x0988
#define LIGHTRANGER8_RANGING_CORE_RANGE_REF_1_LLL                                       0x0989
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_1_MMM                           0x098A
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_1_LMM                           0x098B
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_1_LLM                           0x098C
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_1_LLL                           0x098D
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_1_MMM                            0x098E
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_1_LMM                            0x098F
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_1_LLM                            0x0990
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_1_LLL                            0x0991
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_1_MMM                             0x0992
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_1_LMM                             0x0993
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_1_LLM                             0x0994
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_1_LLL                             0x0995
#define LIGHTRANGER8_RANGING_CORE_TOTAL_PERIODS_ELAPSED_1_MM                            0x0996
#define LIGHTRANGER8_RANGING_CORE_TOTAL_PERIODS_ELAPSED_1_LM                            0x0997
#define LIGHTRANGER8_RANGING_CORE_TOTAL_PERIODS_ELAPSED_1_LL                            0x0998
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_MISMATCH_MM                                   0x0999
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_MISMATCH_LM                                   0x099A
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_MISMATCH_LL                                   0x099B
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_REF_1_MMM                       0x099C
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_REF_1_LMM                       0x099D
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_REF_1_LLM                       0x099E
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_WINDOW_EVENTS_REF_1_LLL                       0x099F
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_REF_1_MMM                        0x09A0
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_REF_1_LMM                        0x09A1
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_REF_1_LLM                        0x09A2
#define LIGHTRANGER8_RANGING_CORE_RANGING_TOTAL_EVENTS_REF_1_LLL                        0x09A3
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_REF_1_MMM                         0x09A4
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_REF_1_LMM                         0x09A5
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_REF_1_LLM                         0x09A6
#define LIGHTRANGER8_RANGING_CORE_SIGNAL_TOTAL_EVENTS_REF_1_LLL                         0x09A7
#define LIGHTRANGER8_RANGING_CORE_TOTAL_PERIODS_ELAPSED_REF_1_MM                        0x09A8
#define LIGHTRANGER8_RANGING_CORE_TOTAL_PERIODS_ELAPSED_REF_1_LM                        0x09A9
#define LIGHTRANGER8_RANGING_CORE_TOTAL_PERIODS_ELAPSED_REF_1_LL                        0x09AA
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_MISMATCH_REF_MM                               0x09AB
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_MISMATCH_REF_LM                               0x09AC
#define LIGHTRANGER8_RANGING_CORE_AMBIENT_MISMATCH_REF_LL                               0x09AD
#define LIGHTRANGER8_RANGING_CORE_GPIO_CONFIG_A0                                        0x0A00
#define LIGHTRANGER8_RANGING_CORE_RESET_CONTROL_A0                                      0x0A01
#define LIGHTRANGER8_RANGING_CORE_INTR_MANAGER_A0                                       0x0A02
#define LIGHTRANGER8_RANGING_CORE_POWER_FSM_TIME_OSC_A0                                 0x0A06
#define LIGHTRANGER8_RANGING_CORE_VCSEL_ATEST_A0                                        0x0A07
#define LIGHTRANGER8_RANGING_CORE_VCSEL_PERIOD_CLIPPED_A0                               0x0A08
#define LIGHTRANGER8_RANGING_CORE_VCSEL_STOP_CLIPPED_A0                                 0x0A09
#define LIGHTRANGER8_RANGING_CORE_CALIB_2_A0                                            0x0A0A
#define LIGHTRANGER8_RANGING_CORE_STOP_CONDITION_A0                                     0x0A0B
#define LIGHTRANGER8_RANGING_CORE_STATUS_RESET_A0                                       0x0A0C
#define LIGHTRANGER8_RANGING_CORE_READOUT_CFG_A0                                        0x0A0D
#define LIGHTRANGER8_RANGING_CORE_WINDOW_SETTING_A0                                     0x0A0E
#define LIGHTRANGER8_RANGING_CORE_VCSEL_DELAY_A0                                        0x0A1A
#define LIGHTRANGER8_RANGING_CORE_REFERENCE_2_A0                                        0x0A1B
#define LIGHTRANGER8_RANGING_CORE_REGAVDD1V2_A0                                         0x0A1D
#define LIGHTRANGER8_RANGING_CORE_TST_MUX_A0                                            0x0A1F
#define LIGHTRANGER8_RANGING_CORE_CUSTOM_FE_2_A0                                        0x0A20
#define LIGHTRANGER8_RANGING_CORE_SPAD_READOUT_A0                                       0x0A21
#define LIGHTRANGER8_RANGING_CORE_CPUMP_1_A0                                            0x0A22
#define LIGHTRANGER8_RANGING_CORE_SPARE_REGISTER_A0                                     0x0A23
#define LIGHTRANGER8_RANGING_CORE_VCSEL_CONT_STAGE5_BYPASS_A0                           0x0A24
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_18                                        0x0A25
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_19                                        0x0A26
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_20                                        0x0A27
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_21                                        0x0A28
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_22                                        0x0A29
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_23                                        0x0A2A
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_24                                        0x0A2B
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_25                                        0x0A2C
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_26                                        0x0A2D
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_27                                        0x0A2E
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_28                                        0x0A2F
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_29                                        0x0A30
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_30                                        0x0A31
#define LIGHTRANGER8_RANGING_CORE_RET_SPAD_EN_31                                        0x0A32
#define LIGHTRANGER8_RANGING_CORE_REF_SPAD_EN_0_EWOK                                    0x0A33
#define LIGHTRANGER8_RANGING_CORE_REF_SPAD_EN_1_EWOK                                    0x0A34
#define LIGHTRANGER8_RANGING_CORE_REF_SPAD_EN_2_EWOK                                    0x0A35
#define LIGHTRANGER8_RANGING_CORE_REF_SPAD_EN_3_EWOK                                    0x0A36
#define LIGHTRANGER8_RANGING_CORE_REF_SPAD_EN_4_EWOK                                    0x0A37
#define LIGHTRANGER8_RANGING_CORE_REF_SPAD_EN_5_EWOK                                    0x0A38
#define LIGHTRANGER8_RANGING_CORE_REF_EN_START_SELECT                                   0x0A39
#define LIGHTRANGER8_RANGING_CORE_REGDVDD1V2_ATEST_EWOK                                 0x0A41
#define LIGHTRANGER8_SOFT_RESET_GO1                                                     0x0B00
#define LIGHTRANGER8_PRIVATE_PATCH_BASE_ADDR_RSLV                                       0x0E00
#define LIGHTRANGER8_PREV_SHADOW_RESULT_INTERRUPT_STATUS                                0x0ED0
#define LIGHTRANGER8_PREV_SHADOW_RESULT_RANGE_STATUS                                    0x0ED1
#define LIGHTRANGER8_PREV_SHADOW_RESULT_REPORT_STATUS                                   0x0ED2
#define LIGHTRANGER8_PREV_SHADOW_RESULT_STREAM_COUNT                                    0x0ED3
#define LIGHTRANGER8_PREV_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0                  0x0ED4
#define LIGHTRANGER8_PREV_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI               0x0ED4
#define LIGHTRANGER8_PREV_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO               0x0ED5
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0                 0x0ED6
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI              0x0ED6
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO              0x0ED7
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0                     0x0ED8
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0_HI                  0x0ED8
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0_LO                  0x0ED9
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SIGMA_SD0                                       0x0EDA
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SIGMA_SD0_HI                                    0x0EDA
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SIGMA_SD0_LO                                    0x0EDB
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PHASE_SD0                                       0x0EDC
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PHASE_SD0_HI                                    0x0EDC
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PHASE_SD0_LO                                    0x0EDD
#define LIGHTRANGER8_PREV_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0          0x0EDE
#define LIGHTRANGER8_PREV_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI                     0x0EDE
#define LIGHTRANGER8_PREV_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO                     0x0EDF
#define LIGHTRANGER8_PREV_PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0           0x0EE0
#define LIGHTRANGER8_PPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI            0x0EE0
#define LIGHTRANGER8_PPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO            0x0EE1
#define LIGHTRANGER8_PREV_SHADOW_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0             0x0EE2
#define LIGHTRANGER8_PREV_SHADOW_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI          0x0EE2
#define LIGHTRANGER8_PREV_SHADOW_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO          0x0EE3
#define LIGHTRANGER8_PREV_SHADOW_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0             0x0EE4
#define LIGHTRANGER8_PREV_SHADOW_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI          0x0EE4
#define LIGHTRANGER8_PREV_SHADOW_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO          0x0EE5
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0                  0x0EE6
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI               0x0EE6
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO               0x0EE7
#define LIGHTRANGER8_PREV_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1                  0x0EE8
#define LIGHTRANGER8_PREV_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI               0x0EE8
#define LIGHTRANGER8_PREV_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO               0x0EE9
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1                 0x0EEA
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI              0x0EEA
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO              0x0EEB
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1                     0x0EEC
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1_HI                  0x0EEC
#define LIGHTRANGER8_PREV_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1_LO                  0x0EED
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SIGMA_SD1                                       0x0EEE
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SIGMA_SD1_HI                                    0x0EEE
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SIGMA_SD1_LO                                    0x0EEF
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PHASE_SD1                                       0x0EF0
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PHASE_SD1_HI                                    0x0EF0
#define LIGHTRANGER8_PREV_SHADOW_RESULT_PHASE_SD1_LO                                    0x0EF1
#define LIGHTRANGER8_PREV_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1          0x0EF2
#define LIGHTRANGER8_PFINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI                         0x0EF2
#define LIGHTRANGER8_PFINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO                         0x0EF3
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_0_SD1                                     0x0EF4
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_0_SD1_HI                                  0x0EF4
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_0_SD1_LO                                  0x0EF5
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_1_SD1                                     0x0EF6
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_1_SD1_HI                                  0x0EF6
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_1_SD1_LO                                  0x0EF7
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_2_SD1                                     0x0EF8
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_2_SD1_HI                                  0x0EF8
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_2_SD1_LO                                  0x0EF9
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_3_SD1                                     0x0EFA
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_3_SD1_HI                                  0x0EFA
#define LIGHTRANGER8_PREV_SHADOW_RESULT_SPARE_3_SD1_LO                                  0x0EFB
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0                  0x0EFC
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_3                0x0EFC
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_2                0x0EFD
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_1                0x0EFE
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_0                0x0EFF
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0                   0x0F00
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_3                 0x0F00
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_2                 0x0F01
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_1                 0x0F02
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_0                 0x0F03
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0                    0x0F04
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_3                  0x0F04
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_2                  0x0F05
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_1                  0x0F06
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_0                  0x0F07
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0                  0x0F08
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_3                0x0F08
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_2                0x0F09
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_1                0x0F0A
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_0                0x0F0B
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1                  0x0F0C
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_3                0x0F0C
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_2                0x0F0D
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_1                0x0F0E
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_0                0x0F0F
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1                   0x0F10
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_3                 0x0F10
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_2                 0x0F11
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_1                 0x0F12
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_0                 0x0F13
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1                    0x0F14
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_3                  0x0F14
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_2                  0x0F15
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_1                  0x0F16
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_0                  0x0F17
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1                  0x0F18
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_3                0x0F18
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_2                0x0F19
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_1                0x0F1A
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_0                0x0F1B
#define LIGHTRANGER8_PREV_SHADOW_RESULT_CORE_SPARE_0                                    0x0F1C
#define LIGHTRANGER8_RESULT_DEBUG_STATUS                                                0x0F20
#define LIGHTRANGER8_RESULT_DEBUG_STAGE                                                 0x0F21
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_RATE_HIGH                                        0x0F24
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_RATE_HIGH_HI                                     0x0F24
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_RATE_HIGH_LO                                     0x0F25
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_RATE_LOW                                         0x0F26
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_RATE_LOW_HI                                      0x0F26
#define LIGHTRANGER8_GPH_SYSTEM_THRESH_RATE_LOW_LO                                      0x0F27
#define LIGHTRANGER8_GPH_SYSTEM_INTERRUPT_CONFIG_GPIO                                   0x0F28
#define LIGHTRANGER8_GPH_DSS_CONFIG_ROI_MODE_CONTROL                                    0x0F2F
#define LIGHTRANGER8_GPH_DSS_CONFIG_MANUAL_EFFECTIVE_SPADS_SELECT                       0x0F30
#define LIGHTRANGER8_GPH_DSS_CONFIG_MANUAL_EFFECTIVE_SPADS_SELECT_HI                    0x0F30
#define LIGHTRANGER8_GPH_DSS_CONFIG_MANUAL_EFFECTIVE_SPADS_SELECT_LO                    0x0F31
#define LIGHTRANGER8_GPH_DSS_CONFIG_MANUAL_BLOCK_SELECT                                 0x0F32
#define LIGHTRANGER8_GPH_DSS_CONFIG_MAX_SPADS_LIMIT                                     0x0F33
#define LIGHTRANGER8_GPH_DSS_CONFIG_MIN_SPADS_LIMIT                                     0x0F34
#define LIGHTRANGER8_GPH_MM_CONFIG_TIMEOUT_MACROP_A_HI                                  0x0F36
#define LIGHTRANGER8_GPH_MM_CONFIG_TIMEOUT_MACROP_A_LO                                  0x0F37
#define LIGHTRANGER8_GPH_MM_CONFIG_TIMEOUT_MACROP_B_HI                                  0x0F38
#define LIGHTRANGER8_GPH_MM_CONFIG_TIMEOUT_MACROP_B_LO                                  0x0F39
#define LIGHTRANGER8_GPH_RANGE_CONFIG_TIMEOUT_MACROP_A_HI                               0x0F3A
#define LIGHTRANGER8_GPH_RANGE_CONFIG_TIMEOUT_MACROP_A_LO                               0x0F3B
#define LIGHTRANGER8_GPH_RANGE_CONFIG_VCSEL_PERIOD_A                                    0x0F3C
#define LIGHTRANGER8_GPH_RANGE_CONFIG_VCSEL_PERIOD_B                                    0x0F3D
#define LIGHTRANGER8_GPH_RANGE_CONFIG_TIMEOUT_MACROP_B_HI                               0x0F3E
#define LIGHTRANGER8_GPH_RANGE_CONFIG_TIMEOUT_MACROP_B_LO                               0x0F3F
#define LIGHTRANGER8_GPH_RANGE_CONFIG_SIGMA_THRESH                                      0x0F40
#define LIGHTRANGER8_GPH_RANGE_CONFIG_SIGMA_THRESH_HI                                   0x0F40
#define LIGHTRANGER8_GPH_RANGE_CONFIG_SIGMA_THRESH_LO                                   0x0F41
#define LIGHTRANGER8_GPH_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT_MCPS                     0x0F42
#define LIGHTRANGER8_GPH_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT_MCPS_HI                  0x0F42
#define LIGHTRANGER8_GPH_RANGE_CONFIG_MIN_COUNT_RATE_RTN_LIMIT_MCPS_LO                  0x0F43
#define LIGHTRANGER8_GPH_RANGE_CONFIG_VALID_PHASE_LOW                                   0x0F44
#define LIGHTRANGER8_GPH_RANGE_CONFIG_VALID_PHASE_HIGH                                  0x0F45
#define LIGHTRANGER8_FIRMWARE_INTERNAL_STREAM_COUNT_DIV                                 0x0F46
#define LIGHTRANGER8_FIRMWARE_INTERNAL_STREAM_COUNTER_VAL                               0x0F47
#define LIGHTRANGER8_DSS_CALC_ROI_CTRL                                                  0x0F54
#define LIGHTRANGER8_DSS_CALC_SPARE_1                                                   0x0F55
#define LIGHTRANGER8_DSS_CALC_SPARE_2                                                   0x0F56
#define LIGHTRANGER8_DSS_CALC_SPARE_3                                                   0x0F57
#define LIGHTRANGER8_DSS_CALC_SPARE_4                                                   0x0F58
#define LIGHTRANGER8_DSS_CALC_SPARE_5                                                   0x0F59
#define LIGHTRANGER8_DSS_CALC_SPARE_6                                                   0x0F5A
#define LIGHTRANGER8_DSS_CALC_SPARE_7                                                   0x0F5B
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_0                                        0x0F5C
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_1                                        0x0F5D
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_2                                        0x0F5E
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_3                                        0x0F5F
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_4                                        0x0F60
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_5                                        0x0F61
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_6                                        0x0F62
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_7                                        0x0F63
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_8                                        0x0F64
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_9                                        0x0F65
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_10                                       0x0F66
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_11                                       0x0F67
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_12                                       0x0F68
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_13                                       0x0F69
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_14                                       0x0F6A
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_15                                       0x0F6B
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_16                                       0x0F6C
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_17                                       0x0F6D
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_18                                       0x0F6E
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_19                                       0x0F6F
