LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_20                                       0x0F70
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_21                                       0x0F71
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_22                                       0x0F72
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_23                                       0x0F73
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_24                                       0x0F74
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_25                                       0x0F75
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_26                                       0x0F76
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_27                                       0x0F77
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_28                                       0x0F78
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_29                                       0x0F79
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_30                                       0x0F7A
#define LIGHTRANGER8_DSS_CALC_USER_ROI_SPAD_EN_31                                       0x0F7B
#define LIGHTRANGER8_DSS_CALC_USER_ROI_0                                                0x0F7C
#define LIGHTRANGER8_DSS_CALC_USER_ROI_1                                                0x0F7D
#define LIGHTRANGER8_DSS_CALC_MODE_ROI_0                                                0x0F7E
#define LIGHTRANGER8_DSS_CALC_MODE_ROI_1                                                0x0F7F
#define LIGHTRANGER8_SIGMA_ESTIMATOR_CALC_SPARE_0                                       0x0F80
#define LIGHTRANGER8_VHV_RESULT_PEAK_SIGNAL_RATE_MCPS                                   0x0F82
#define LIGHTRANGER8_VHV_RESULT_PEAK_SIGNAL_RATE_MCPS_HI                                0x0F82
#define LIGHTRANGER8_VHV_RESULT_PEAK_SIGNAL_RATE_MCPS_LO                                0x0F83
#define LIGHTRANGER8_VHV_RESULT_SIGNAL_TOTAL_EVENTS_REF                                 0x0F84
#define LIGHTRANGER8_VHV_RESULT_SIGNAL_TOTAL_EVENTS_REF_3                               0x0F84
#define LIGHTRANGER8_VHV_RESULT_SIGNAL_TOTAL_EVENTS_REF_2                               0x0F85
#define LIGHTRANGER8_VHV_RESULT_SIGNAL_TOTAL_EVENTS_REF_1                               0x0F86
#define LIGHTRANGER8_VHV_RESULT_SIGNAL_TOTAL_EVENTS_REF_0                               0x0F87
#define LIGHTRANGER8_PHASECAL_RESULT_PHASE_OUTPUT_REF                                   0x0F88
#define LIGHTRANGER8_PHASECAL_RESULT_PHASE_OUTPUT_REF_HI                                0x0F88
#define LIGHTRANGER8_PHASECAL_RESULT_PHASE_OUTPUT_REF_LO                                0x0F89
#define LIGHTRANGER8_DSS_RESULT_TOTAL_RATE_PER_SPAD                                     0x0F8A
#define LIGHTRANGER8_DSS_RESULT_TOTAL_RATE_PER_SPAD_HI                                  0x0F8A
#define LIGHTRANGER8_DSS_RESULT_TOTAL_RATE_PER_SPAD_LO                                  0x0F8B
#define LIGHTRANGER8_DSS_RESULT_ENABLED_BLOCKS                                          0x0F8C
#define LIGHTRANGER8_DSS_RESULT_NUM_REQUESTED_SPADS                                     0x0F8E
#define LIGHTRANGER8_DSS_RESULT_NUM_REQUESTED_SPADS_HI                                  0x0F8E
#define LIGHTRANGER8_DSS_RESULT_NUM_REQUESTED_SPADS_LO                                  0x0F8F
#define LIGHTRANGER8_MM_RESULT_INNER_INTERSECTION_RATE                                  0x0F92
#define LIGHTRANGER8_MM_RESULT_INNER_INTERSECTION_RATE_HI                               0x0F92
#define LIGHTRANGER8_MM_RESULT_INNER_INTERSECTION_RATE_LO                               0x0F93
#define LIGHTRANGER8_MM_RESULT_OUTER_COMPLEMENT_RATE                                    0x0F94
#define LIGHTRANGER8_MM_RESULT_OUTER_COMPLEMENT_RATE_HI                                 0x0F94
#define LIGHTRANGER8_MM_RESULT_OUTER_COMPLEMENT_RATE_LO                                 0x0F95
#define LIGHTRANGER8_MM_RESULT_TOTAL_OFFSET                                             0x0F96
#define LIGHTRANGER8_MM_RESULT_TOTAL_OFFSET_HI                                          0x0F96
#define LIGHTRANGER8_MM_RESULT_TOTAL_OFFSET_LO                                          0x0F97
#define LIGHTRANGER8_XTALK_CALC_XTALK_FOR_ENABLED_SPADS                                 0x0F98
#define LIGHTRANGER8_XTALK_CALC_XTALK_FOR_ENABLED_SPADS_3                               0x0F98
#define LIGHTRANGER8_XTALK_CALC_XTALK_FOR_ENABLED_SPADS_2                               0x0F99
#define LIGHTRANGER8_XTALK_CALC_XTALK_FOR_ENABLED_SPADS_1                               0x0F9A
#define LIGHTRANGER8_XTALK_CALC_XTALK_FOR_ENABLED_SPADS_0                               0x0F9B
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_USER_ROI_KCPS                               0x0F9C
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_USER_ROI_KCPS_3                             0x0F9C
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_USER_ROI_KCPS_2                             0x0F9D
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_USER_ROI_KCPS_1                             0x0F9E
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_USER_ROI_KCPS_0                             0x0F9F
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_INNER_ROI_KCPS                           0x0FA0
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_INNER_ROI_KCPS_3                         0x0FA0
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_INNER_ROI_KCPS_2                         0x0FA1
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_INNER_ROI_KCPS_1                         0x0FA2
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_INNER_ROI_KCPS_0                         0x0FA3
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_OUTER_ROI_KCPS                           0x0FA4
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_OUTER_ROI_KCPS_3                         0x0FA4
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_OUTER_ROI_KCPS_2                         0x0FA5
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_OUTER_ROI_KCPS_1                         0x0FA6
#define LIGHTRANGER8_XTALK_RESULT_AVG_XTALK_MM_OUTER_ROI_KCPS_0                         0x0FA7
#define LIGHTRANGER8_RANGE_RESULT_ACCUM_PHASE                                           0x0FA8
#define LIGHTRANGER8_RANGE_RESULT_ACCUM_PHASE_3                                         0x0FA8
#define LIGHTRANGER8_RANGE_RESULT_ACCUM_PHASE_2                                         0x0FA9
#define LIGHTRANGER8_RANGE_RESULT_ACCUM_PHASE_1                                         0x0FAA
#define LIGHTRANGER8_RANGE_RESULT_ACCUM_PHASE_0                                         0x0FAB
#define LIGHTRANGER8_RANGE_RESULT_OFFSET_CORRECTED_RANGE                                0x0FAC
#define LIGHTRANGER8_RANGE_RESULT_OFFSET_CORRECTED_RANGE_HI                             0x0FAC
#define LIGHTRANGER8_RANGE_RESULT_OFFSET_CORRECTED_RANGE_LO                             0x0FAD
#define LIGHTRANGER8_SHADOW_PHASECAL_RESULT_VCSEL_START                                 0x0FAE
#define LIGHTRANGER8_SHADOW_RESULT_INTERRUPT_STATUS                                     0x0FB0
#define LIGHTRANGER8_SHADOW_RESULT_RANGE_STATUS                                         0x0FB1
#define LIGHTRANGER8_SHADOW_RESULT_REPORT_STATUS                                        0x0FB2
#define LIGHTRANGER8_SHADOW_RESULT_STREAM_COUNT                                         0x0FB3
#define LIGHTRANGER8_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0                       0x0FB4
#define LIGHTRANGER8_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI                    0x0FB4
#define LIGHTRANGER8_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO                    0x0FB5
#define LIGHTRANGER8_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0                      0x0FB6
#define LIGHTRANGER8_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI                   0x0FB6
#define LIGHTRANGER8_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO                   0x0FB7
#define LIGHTRANGER8_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0                          0x0FB8
#define LIGHTRANGER8_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0_HI                       0x0FB8
#define LIGHTRANGER8_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD0_LO                       0x0FB9
#define LIGHTRANGER8_SHADOW_RESULT_SIGMA_SD0                                            0x0FBA
#define LIGHTRANGER8_SHADOW_RESULT_SIGMA_SD0_HI                                         0x0FBA
#define LIGHTRANGER8_SHADOW_RESULT_SIGMA_SD0_LO                                         0x0FBB
#define LIGHTRANGER8_SHADOW_RESULT_PHASE_SD0                                            0x0FBC
#define LIGHTRANGER8_SHADOW_RESULT_PHASE_SD0_HI                                         0x0FBC
#define LIGHTRANGER8_SHADOW_RESULT_PHASE_SD0_LO                                         0x0FBD
#define LIGHTRANGER8_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0               0x0FBE
#define LIGHTRANGER8_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI            0x0FBE
#define LIGHTRANGER8_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO            0x0FBF
#define LIGHTRANGER8_SHPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0              0x0FC0
#define LIGHTRANGER8_SHPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI           0x0FC0
#define LIGHTRANGER8_SHPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO           0x0FC1
#define LIGHTRANGER8_SHADOW_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0                  0x0FC2
#define LIGHTRANGER8_SHADOW_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI               0x0FC2
#define LIGHTRANGER8_SHADOW_RESULT_MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO               0x0FC3
#define LIGHTRANGER8_SHADOW_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0                  0x0FC4
#define LIGHTRANGER8_SHADOW_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI               0x0FC4
#define LIGHTRANGER8_SHADOW_RESULT_MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO               0x0FC5
#define LIGHTRANGER8_SHADOW_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0                       0x0FC6
#define LIGHTRANGER8_SHADOW_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI                    0x0FC6
#define LIGHTRANGER8_SHADOW_RESULT_AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO                    0x0FC7
#define LIGHTRANGER8_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1                       0x0FC8
#define LIGHTRANGER8_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI                    0x0FC8
#define LIGHTRANGER8_SHADOW_RESULT_DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO                    0x0FC9
#define LIGHTRANGER8_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1                      0x0FCA
#define LIGHTRANGER8_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI                   0x0FCA
#define LIGHTRANGER8_SHADOW_RESULT_PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO                   0x0FCB
#define LIGHTRANGER8_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1                          0x0FCC
#define LIGHTRANGER8_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1_HI                       0x0FCC
#define LIGHTRANGER8_SHADOW_RESULT_AMBIENT_COUNT_RATE_MCPS_SD1_LO                       0x0FCD
#define LIGHTRANGER8_SHADOW_RESULT_SIGMA_SD1                                            0x0FCE
#define LIGHTRANGER8_SHADOW_RESULT_SIGMA_SD1_HI                                         0x0FCE
#define LIGHTRANGER8_SHADOW_RESULT_SIGMA_SD1_LO                                         0x0FCF
#define LIGHTRANGER8_SHADOW_RESULT_PHASE_SD1                                            0x0FD0
#define LIGHTRANGER8_SHADOW_RESULT_PHASE_SD1_HI                                         0x0FD0
#define LIGHTRANGER8_SHADOW_RESULT_PHASE_SD1_LO                                         0x0FD1
#define LIGHTRANGER8_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1               0x0FD2
#define LIGHTRANGER8_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI            0x0FD2
#define LIGHTRANGER8_SHADOW_RESULT_FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO            0x0FD3
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_0_SD1                                          0x0FD4
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_0_SD1_HI                                       0x0FD4
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_0_SD1_LO                                       0x0FD5
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_1_SD1                                          0x0FD6
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_1_SD1_HI                                       0x0FD6
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_1_SD1_LO                                       0x0FD7
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_2_SD1                                          0x0FD8
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_2_SD1_HI                                       0x0FD8
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_2_SD1_LO                                       0x0FD9
#define LIGHTRANGER8_SHADOW_RESULT_SPARE_3_SD1                                          0x0FDA
#define LIGHTRANGER8_SHADOW_RESULT_THRESH_INFO                                          0x0FDB
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0                       0x0FDC
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_3                     0x0FDC
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_2                     0x0FDD
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_1                     0x0FDE
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD0_0                     0x0FDF
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0                        0x0FE0
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_3                      0x0FE0
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_2                      0x0FE1
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_1                      0x0FE2
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD0_0                      0x0FE3
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0                         0x0FE4
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_3                       0x0FE4
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_2                       0x0FE5
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_1                       0x0FE6
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD0_0                       0x0FE7
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0                       0x0FE8
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_3                     0x0FE8
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_2                     0x0FE9
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_1                     0x0FEA
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD0_0                     0x0FEB
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1                       0x0FEC
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_3                     0x0FEC
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_2                     0x0FED
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_1                     0x0FEE
#define LIGHTRANGER8_SHADOW_RESULT_CORE_AMBIENT_WINDOW_EVENTS_SD1_0                     0x0FEF
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1                        0x0FF0
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_3                      0x0FF0
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_2                      0x0FF1
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_1                      0x0FF2
#define LIGHTRANGER8_SHADOW_RESULT_CORE_RANGING_TOTAL_EVENTS_SD1_0                      0x0FF3
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1                         0x0FF4
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_3                       0x0FF4
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_2                       0x0FF5
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_1                       0x0FF6
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SIGNAL_TOTAL_EVENTS_SD1_0                       0x0FF7
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1                       0x0FF8
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_3                     0x0FF8
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_2                     0x0FF9
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_1                     0x0FFA
#define LIGHTRANGER8_SHADOW_RESULT_CORE_TOTAL_PERIODS_ELAPSED_SD1_0                     0x0FFB
#define LIGHTRANGER8_SHADOW_RESULT_CORE_SPARE_0                                         0x0FFC
#define LIGHTRANGER8_SHADOW_PHASECAL_RESULT_REFERENCE_PHASE_HI                          0x0FFE
#define LIGHTRANGER8_SHADOW_PHASECAL_RESULT_REFERENCE_PHASE_LO                          0x0FFF

#define DEV_IDENTIFICATION_MODEL_ID                                     0xEA
#define DEV_REGISTER_READ_LSB                                           0x01
#define DEV_REGISTER_BITMASK_LSB                                        0xFE

