LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
#define DEV_SOFT_RESET_CMD_SET                                          0x00
#define DEV_SOFT_RESET_CMD_CLEAR                                        0x01

#define DEV_SYS_INT_CLEAR_BIT                                           0x01

#define DEV_CMD_RANGING_ENABLE                                          0x40
#define DEV_CMD_RANGING_DISABLE                                         0x00

#define DEV_DATA_READY_BIT                                              0x03

#define DEV_REGISTER_BITMASK_10_BIT                                     0x3FF
#define DEV_REGISTER_BITMASK_30_BIT_SHIFT                               0x40000000
#define DEV_REGISTER_BITMASK_12_BIT_SHIFT                               0x800
#define DEV_REGISTER_CLEAR_LSBYTE                                       0xFFFFFF00
#define DEV_REGISTER_BITMASK_LSBYTE                                     0xFF
#define DEV_REGISTER_BITMASK_U16                                        0x00FF
#define DEV_REGISTER_BITMASK_U32                                        0x000000FF

#define DEV_REGISTER_STATUS_BITMASK                                     0x1F

#define DEV_REGISTER_ROI_GLO_XY_SIZE_NIBBLE_L                           0x0F
#define DEV_REGISTER_ROI_GLO_XY_SIZE_NIBBLE_H                           0xF0

#define DEV_REGISTER_ROI_NIBBLE_H_OFFSET                                4

#define DEV_PART_TO_PART_RANGE_OFFSET_MULT                              4

#define DEV_MM_CONF_INNER_OFFSET_RESET                                  0x0000
#define DEV_MM_CONF_OUTER_OFFSET_RESET                                  0x0000
#define DEV_PART_TO_PART_RANGE_OFFSET_RESET                             0x0000

#define DEV_FIRMWARE_READ_TIMEOUT                                       100

#define DEV_ROI_DEFAULT_CENTER_VAL                                      199
#define DEV_ROI_MAX_VAL                                                 16
#define DEV_ROI_CENTER_EDGE_VAL                                         10

#define DEV_MEASUREMENT_BUDGET_MIN                                      4528
#define DEV_MEASUREMENT_BUDGET_MAX                                      1100000
#define DEV_MEASUREMENT_PHASECAL_TIMEOUT                                1000
#define DEV_MEASUREMENT_PHASECAL_TIMEOUT_MAX                            0xFF

#define DEV_CLOCK_COEFF                                                 1.065
#define DEV_MACRO_PERIOD_COEFF                                          2304

// Default config macros
#define DEV_DEFAULT_INT_POL                                             0x02
#define DEV_DEFAULT_PULSE_WIDTH_NS                                      0x08
#define DEV_DEFAULT_AMBIENT_WIDTH_NS                                    0x10
#define DEV_DEFAULT_CC_VALID_HEIGHT_MM                                  0x01
#define DEV_DEFAULT_RAN_IGN_VAL_HEIGHT_MM                               0xFF
#define DEV_DEFAULT_RAN_MIN_CLIP                                        0x00
#define DEV_DEFAULT_CONSISTENCY_CHECK_TOL                               0x02
#define DEV_DEFAULT_THRESH_RATE_HIGH                                    0x0000
#define DEV_DEFAULT_THRESH_RATE_LOW                                     0x0000
#define DEV_DEFAULT_DSS_CONF_AP_ATT                                     0x38
#define DEV_DEFAULT_RAN_CONF_SIGMA_THRESH                               0x0168
#define DEV_DEFAULT_RAN_CONF_MIN_CNT_RATE_LIM_MCPS                      0x00C0
#define DEV_DEFAULT_GROUPED_PARAM_HOLD_0                                0x01
#define DEV_DEFAULT_GROUPED_PARAM_HOLD_1                                0x01
#define DEV_DEFAULT_SD_CONF_QUANTIFIER                                  0x02
#define DEV_DEFAULT_GROUPED_PARAM_HOLD                                  0x00
#define DEV_DEFAULT_SEED_CONF                                           0x01
#define DEV_DEFAULT_SEQUENCE_CONF                                       0x8B
#define DEV_DEFAULT_DSS_CONF_MAN_EFF_SPADS_SELECT                       0xC800
#define DEV_DEFAULT_DSS_CONF_ROI_MODE_CONTROL                           0x02

// Distance mode config macros
#define DEV_SHORT_MODE_RAN_CONF_PERIOD_A                                0x07
#define DEV_SHORT_MODE_RAN_CONF_PERIOD_B                                0x05
#define DEV_SHORT_MODE_RAN_CONF_VAL_PH_H                                0x38
#define DEV_SHORT_MODE_SD_CONFIG_WOI_SD0                                0x07
#define DEV_SHORT_MODE_SD_CONFIG_WOI_SD1                                0x05
#define DEV_SHORT_MODE_SD_CONF_IN_PH_SD0                                0x06
#define DEV_SHORT_MODE_SD_CONF_IN_PH_SD1                                0x06

#define DEV_MEDIUM_MODE_RAN_CONF_PERIOD_A                               0x0B
#define DEV_MEDIUM_MODE_RAN_CONF_PERIOD_B                               0x09
#define DEV_MEDIUM_MODE_RAN_CONF_VAL_PH_H                               0x78
#define DEV_MEDIUM_MODE_SD_CONFIG_WOI_SD0                               0x0B
#define DEV_MEDIUM_MODE_SD_CONFIG_WOI_SD1                               0x09
#define DEV_MEDIUM_MODE_SD_CONF_IN_PH_SD0                               0x0A
#define DEV_MEDIUM_MODE_SD_CONF_IN_PH_SD1                               0x0A

#define DEV_LONG_MODE_RAN_CONF_PERIOD_A                                 0x0F
#define DEV_LONG_MODE_RAN_CONF_PERIOD_B                                 0x0D
#define DEV_LONG_MODE_RAN_CONF_VAL_PH_H                                 0xB8
#define DEV_LONG_MODE_SD_CONFIG_WOI_SD0                                 0x0F
#define DEV_LONG_MODE_SD_CONFIG_WOI_SD1                                 0x0D
#define DEV_LONG_MODE_SD_CONF_IN_PH_SD0                                 0x0E
#define DEV_LONG_MODE_SD_CONF_IN_PH_SD1                                 0x0E

#define LIGHTRANGER8_SET_DEV_ADDR                                0x29


/*
 * @brief LightRanger 8 distance modes.
 * @details Settings of ranging distance modes of LightRanger 8 Click driver.
 */

#define LIGHTRANGER8_DISTANCE_MODE_SHORT                         0x00
#define LIGHTRANGER8_DISTANCE_MODE_MEDIUM                        0x01
#define LIGHTRANGER8_DISTANCE_MODE_LONG                          0x02




/**
 * @brief LightRanger 8 ranging modes.
 * @details Settings for enable/disable ranging of LightRanger 8 Click driver.
 */

