LAPSyLAB/STM32H750B-DK_Docs_and_Examples/Examples/KLEMEN BRANISELJ_H7_LightRanger8_Click_Zaznavanje TOF/Lightranger8/Core/Inc/lightranger8.h
#define LIGHTRANGER8_RANGING_ENABLE                              0x00
#define LIGHTRANGER8_RANGING_DISABLE                             0x01



/**
 * @brief LightRanger 8 error codes.
 * @details Error codes from init of LightRanger 8 Click driver.
 */
#define LIGHTRANGER8_OK                                          0
#define LIGHTRANGER8_ERROR




/**
 * @brief LightRanger 8 response codes.
 * @details Response returns from settings of LightRanger 8 Click driver.
 */

#define LIGHTRANGER8_RESP_INSUFFICIENT_BUDGET                    0x02
#define LIGHTRANGER8_RESP_TOO_HIGH_BUDGET                        0x01
#define LIGHTRANGER8_RESP_BUDGET_IS_SUCCESSFULLY_SET             0x00
#define LIGHTRANGER8_RESP_DEVICE_ERROR_ID_IS_NOT_VALID           0x01
#define LIGHTRANGER8_RESP_FIRMWARE_TIMEOUT_ERROR                 0x02
#define LIGHTRANGER8_RESP_INIT_IS_SUCCESSFUL                     0x00
#define LIGHTRANGER8_RESP_WRONG_MODE                             0x01
#define LIGHTRANGER8_RESP_MODE_SUCCESSFULLY_SET                  0x00
#define LIGHTRANGER8_MRESP_SIGNAL_FAIL                           0x04
#define LIGHTRANGER8_MRESP_PHASE_OUT_OF_VALID_LIMITS             0x05
#define LIGHTRANGER8_MRESP_SIGMA_FAIL                            0x06
#define LIGHTRANGER8_MRESP_WRAP_TARGET_FAIL                      0x07
#define LIGHTRANGER8_MRESP_MINIMUM_DETECTION_THRESHOLD           0x08



// Define the context object
typedef struct {

	 GPIO_TypeDef *en_port;      /**< GPIO port for EN (Xshut) pin */
	 uint16_t en_pin;            /**< GPIO pin number for EN (Xshut) */

	 // Input pins
	 GPIO_TypeDef *int_pin_port; /**< GPIO port for interrupt pin */
	 uint16_t int_pin;           /**< GPIO pin number for interrupt pin */


	 i2c_master_t i2c;

    I2C_HandleTypeDef *i2c_handle;
    uint16_t i2c_address;
    uint8_t slave_address;

    uint16_t fast_osc_frequency;
    uint16_t osc_calibrate_val;





} lightranger8_t;


typedef struct
{
    GPIO_TypeDef* scl_port;   /**< Port for the I2C clock pin (SCL). */
    uint16_t scl_pin;         /**< Pin number for the I2C clock pin (SCL). */

    GPIO_TypeDef* sda_port;   /**< Port for the I2C data pin (SDA). */
    uint16_t sda_pin;         /**< Pin number for the I2C data pin (SDA). */

    GPIO_TypeDef* en_port;    /**< Port for the Xshut (enable) pin. */
    uint16_t en_pin;          /**< Pin number for the Xshut (enable) pin. */

    GPIO_TypeDef* int_port;   /**< Port for the interrupt pin (GPIO1). */
    uint16_t int_pin;         /**< Pin number for the interrupt pin (GPIO1). */

    uint32_t  i2c_speed;      /**< I2C serial speed. */
    uint8_t   i2c_address;    /**< I2C slave address. */

} lightranger8_cfg_t;


// ---------------------------------------------- PRIVATE FUNCTION DECLARATIONS

// Calculate time functions

uint16_t encode_timeout ( uint32_t timeout_mclks );
uint32_t timeout_mclks_to_microseconds ( uint32_t timeout_mclks, uint32_t macro_period_us );
uint32_t decode_timeout ( uint16_t reg_val );



// Driver delays
void delay_power_full_on ( lightranger8_t *ctx );
void delay_power_up ( lightranger8_t *ctx );
void delay_config_set ( lightranger8_t *ctx );
void delay_soft_reset ( lightranger8_t *ctx );
void delay_data_ready ( lightranger8_t *ctx );

// Writing 8-bit data to a register
void lightranger8_init(lightranger8_t *ctx, lightranger8_cfg_t *cfg);
void lightranger8_cfg_setup(lightranger8_cfg_t *cfg);
